# Part 3
For part 3 of the project you will be practicing applying an E.T.L process on your previously saved movie data. Specifically, you will create a new MySQL database after preparing the data for a relational database. You will export your database to a .sql file in your repository using MySQL Workbench.

## Specifications - Database
- Your stakeholder wants you to take the data you have been cleaning and collecting in Parts 1 & 2 of the project and wants you to create a MySQL database for them.

- Specifically, they want the data from the following files included in your database:

- Title Basics:
    - Movie ID (tconst)
    - Primary Title
    - Start Year
    - Runtime (in Minutes)
    - Genres

- Title Ratings
    - Movie ID (tconst)
    - Average Movie Rating
    - Number of Votes

- The TMDB API Results (multiple files)
    - Movie ID
    - Revenue
    - Budget
    - Certification (MPAA Rating)

- You should normalize the tables as best you can before adding them to your new database.

    - Note: an important exception to their request is that they would like you to keep all of the data from the TMDB API in 1 table together (even though it will not be perfectly normalized).
    - You only need to keep the imdb_id, revenue, budget, and certification columns

## Required Transformation Steps for Title Basics:
- Normalize Genre:

    - Convert the single string of genres from title basics into 2 new tables.
        1. title_genres: with the columns:

            - tconst
            - genre_id
        2. genres:

            - genre_id
            - genre_name
            
- Discard unnecessary information:

    - For the title basics table, drop the following columns:
          
        - "original_title" (we will use the primary title column instead)
        - "isAdult" ("Adult" will show up in the genres so this is redundant information).
        - "titleType" (every row will be a movie).
        - "genres" and other variants of genre (genre is now represented in the 2 new tables described above.
    - Do not include the title_akas table in your SQL database.
        - You have already filtered out the desired movies using this table, and the remaining data is mostly nulls and not of interest to the stakeholder.

## MySQL Database Requirements
   
   - Use sqlalchemy with Pandas to execute your SQL queries inside your notebook.

    - Create a new database on your MySQL server and call it "movies."

    - Make sure to have the following tables in your "movies" database:
    
        - title_basics
        - title_ratings
        - title_genres
        - genres
        - tmdb_data

  - Make sure to set a Primary Key for each table that isn't a joiner table (e.g., title_genres is a joiner table).
   
  - After creating each table, show the first 5 rows of that table using a SQL query.

  - Make sure to run the "SHOW TABLES" SQL query at the end of your notebook to show that all required tables have been created.

## Import Libraries

In [2]:
!pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in /Users/tjbingamon/anaconda3/envs/dojo-env/lib/python3.9/site-packages (8.0.33)
Requirement already satisfied: protobuf<=3.20.3,>=3.11.0 in /Users/tjbingamon/anaconda3/envs/dojo-env/lib/python3.9/site-packages (from mysql-connector-python) (3.19.6)

In [3]:
# Imports
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import json

import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy.types import *
from sqlalchemy_utils import create_database, database_exists
from sqlalchemy import create_engine
import mysql.connector

In [4]:
# Load the dataframe
title_basics_df = pd.read_csv('Data/title_basics.csv.gz')
# Display the first (2) rows
title_basics_df.head(2)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,tt0043139,movie,Life of a Beijing Policeman,Wo zhe yi bei zi,0,2013.0,NaN,120,"Drama,History"

In [5]:
ratings_df = pd.read_csv('Data/title_ratings.csv.gz')
ratings_df.head(2)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1982
1  tt0000002            5.8       265

In [6]:
# Load the dataframe from the csv file
df_tmdb = pd.read_csv('Data/tmbd_results_combined.csv.gz')
df_tmdb.head(2)

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.500,22.0,NaN
1,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,"{'id': 1131062, 'name': 'Wong Kar-Wai’s Love T...",150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",NaN,843.0,cn,花樣年華,...,14204632.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.112,2245.0,PG

## Selecting Columns

### title_basics
- Movie ID (tconst)
- Primary Title
- Start Year
- Runtime (in Minutes)
- Genres

In [7]:
title_basics_df = title_basics_df[['tconst', 'primaryTitle', 'startYear', 'endYear', 'runtimeMinutes',
                      'genres']]
title_basics_df.head(2)

,tconst,primaryTitle,startYear,endYear,runtimeMinutes,genres
0,tt0035423,Kate & Leopold,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,tt0043139,Life of a Beijing Policeman,2013.0,NaN,120,"Drama,History"

### tmdb

- Movie ID
- Revenue
- Budget
- Certification (MPAA Rating)

In [8]:
df_tmdb = df_tmdb[['imdb_id', 'budget', 'revenue', 'certification']]
df_tmdb

       imdb_id      budget      revenue certification
0    tt0113026  10000000.0          0.0           NaN
1    tt0118694    150000.0   14204632.0            PG
2    tt0119273  15000000.0          0.0             R
3    tt0120263         0.0      80334.0           NaN
4    tt0120467    120000.0      14904.0             R
..         ...         ...          ...           ...
634  tt0445841  12500000.0  123021750.0           NaN
635  tt0867181      5000.0          0.0           NaN
636  tt1039952    500000.0     500000.0           NaN
637  tt1764172    250000.0          0.0           NaN
638  tt2957918      2000.0          0.0           NaN

[639 rows x 4 columns]

### Remove Empty Rows

In [9]:
df_tmdb.drop(0, axis = 'index', inplace=True)

In [10]:
df_tmdb[df_tmdb['imdb_id'] == '0']

Empty DataFrame
Columns: [imdb_id, budget, revenue, certification]
Index: []

In [11]:
df_tmdb.reset_index(drop=True).head(2)

     imdb_id      budget     revenue certification
0  tt0118694    150000.0  14204632.0            PG
1  tt0119273  15000000.0         0.0             R

## Normalizing title_basics 'genres'

### List of Unique Genres

In [12]:
title_basics_df['genres_split'] = title_basics_df['genres'].str.split(',')
title_basics_df.head(2)

,tconst,primaryTitle,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,Kate & Leopold,2001.0,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0043139,Life of a Beijing Policeman,2013.0,NaN,120,"Drama,History","[Drama, History]"

- use .explode() to separate the list of genres into new rows: one row for each genre a movie belonged to.

In [13]:
# Create a new dataframe with a row
# for each genre a movie belongs to by using .explode
exploded_genres_df = title_basics_df.explode('genres_split')
# Display the first (10) rows
exploded_genres_df.head(10)

,tconst,primaryTitle,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,Kate & Leopold,2001.0,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,Kate & Leopold,2001.0,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,Kate & Leopold,2001.0,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0043139,Life of a Beijing Policeman,2013.0,NaN,120,"Drama,History",Drama
1,tt0043139,Life of a Beijing Policeman,2013.0,NaN,120,"Drama,History",History
2,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,NaN,70,Drama,Drama
3,tt0069049,The Other Side of the Wind,2018.0,NaN,122,Drama,Drama
4,tt0088751,The Naked Monster,2005.0,NaN,100,"Comedy,Horror,Sci-Fi",Comedy
4,tt0088751,The Naked Monster,2005.0,NaN,100,"Comedy,Horror,Sci-Fi",Horror
4,tt0088751,The Naked Monster,2005.0,NaN,100,"Comedy,Horror,Sci-Fi",Sci-Fi

In [14]:
# Create a list of unique genres from the genres_split column
unique_genres = sorted(exploded_genres_df['genres_split'].unique())

In [15]:
# Display the list of unique genres
unique_genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

In [16]:
len(unique_genres)

25

### Create a new title_genres table

In [18]:
# Save tconst and genres_split as a new df
title_genres_df = exploded_genres_df[['tconst', 'genres_split']].copy()
# Display the first (5) rows
title_genres_df.head(5)

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0043139        Drama
1  tt0043139      History

### Create a genre mapper dictionary to replace string genres with integers

In [19]:
# Make a dictionary
# with list of unique genres as the key and the new integer id as values
genre_id_map = dict(zip(unique_genres, range(len(unique_genres))))
# Display the genre_id_map dictionary
genre_id_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Sport': 20,
 'Talk-Show': 21,
 'Thriller': 22,
 'War': 23,
 'Western': 24}

### Replace the string genres in title_genres with the new integer ids.
- Create a new genre_id column using the genre_map dictionary with either .map or .replace.
- Next, drop the "genres_split" column.
- The title_genres table is now ready for the MySQL database

In [19]:
# Create a genre_id column using the genre_map dictionary with .map
title_genres_df['genre_id'] = title_genres_df['genres_split'].map(genre_id_map)
# Drop the "genres_split" column
title_genres_df = title_genres_df.drop(columns='genres_split')

In [20]:
# Display the first (5) rows
title_genres_df.head(5)

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0043139         7
1  tt0043139        11

### Convert genre map dictionary into a dataframe

In [20]:
# Create a dataframe from the genre_map dictionary with .map
genres_df = pd.DataFrame({'genre_name': genre_id_map.keys(),
                           'genre_id': genre_id_map.values()})
# Display the first (5) rows
genres_df.head(5)

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

## Create SQL Movies Database

In [21]:
# Create connection string using credentials following this format
# connection = "dialect+driver://username:password@host:port/database"
username = "root"
password = "GoLakers1988!" 
db_name = "movies"
connection = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"

In [22]:
# Create a connection string using credentials following this format:
# connection = "dialect+driver://username:password@host:port/database"
database_name = "movies"
connection_str = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"

In [23]:
# Create an instance of the sqlalchemy Engine Class 
engine = create_engine(connection_str)

In [24]:
# Create the Movies database, if it does not already exist
if database_exists(connection_str) == False: create_database(connection_str)
else: print('The database already exists.')

The database already exists.

### Create SQL Tables

#### title_basics SQL Table

In [26]:
# Display the names, non-null values, and datatypes for the columns
title_basics_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 81843 entries, 0 to 81842
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          81843 non-null  object
 1   primaryTitle    81843 non-null  object
 2   startYear       81843 non-null  float64
 3   endYear         0 non-null      float64
 4   runtimeMinutes  81843 non-null  int64
 5   genres          81843 non-null  object
 6   genres_split    81843 non-null  object
dtypes: float64(2), int64(1), object(4)
memory usage: 4.4+ MB

In [28]:
title_basics_df = title_basics_df[['tconst', 'primaryTitle', 'startYear', 'endYear', 'runtimeMinutes']]
title_basics_df.head(2)

      tconst                 primaryTitle  startYear  endYear  runtimeMinutes
0  tt0035423               Kate & Leopold     2001.0      NaN             118
1  tt0043139  Life of a Beijing Policeman     2013.0      NaN             120

### Converting data to SQL Table

In [29]:
# Calculate max string lengths for object columns
key_len = title_basics_df['tconst'].fillna('').map(len).max()
title_len = title_basics_df['primaryTitle'].fillna('').map(len).max()

# Use 1 + the max_str_len for object columns ('tconst' and 'primaryTitle') 
# Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    'tconst': String(key_len+1), 
    'primaryTitle': Text(title_len+1),
    'startYear': Integer(),
    'runtimeMinutes': Integer()}

In [30]:
# Save the dataframe to an sql table
# with appropriate datatypes and set index=False
title_basics_df.to_sql('title_basics',
              engine, 
              dtype=df_schema,
              if_exists='replace',
              index=False)

81843

In [31]:
# Use the sqlalchemy engine to update the table, and 
# set the desired column as the primary key
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [32]:
q = """SELECT * FROM title_basics LIMIT 5;"""
pd.read_sql(q, engine)

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001,None,118
1,tt0043139,Life of a Beijing Policeman,2013,None,120
2,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,None,70
3,tt0069049,The Other Side of the Wind,2018,None,122
4,tt0088751,The Naked Monster,2005,None,100

In [33]:
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_movies
0     title_basics
1     title_genres
2    title_ratings
3        tmdb_data

### title_ratings SQL Table

In [34]:
# Display the names, non-null values, and datatypes for the columns
ratings_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 502824 entries, 0 to 502823
Data columns (total 3 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   tconst         502824 non-null  object
 1   averageRating  502824 non-null  float64
 2   numVotes       502824 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 11.5+ MB

In [35]:
## Calculate max string lengths for object columns
key_len = ratings_df['tconst'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
ratings_df_schema = {
    "tconst": String(key_len+1), 
    'averageRating':Float(),
    'numVotes':Integer()}

In [37]:
# Save to sql with dtype and index=False
ratings_df.to_sql('title_ratings',
                 engine,
                 dtype=ratings_df_schema,
                 if_exists='replace', index=False)

502824

In [38]:
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

In [39]:
q_ratings = """

SELECT *
FROM title_ratings
LIMIT 5;

"""

pd.read_sql(q_ratings, engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1982
1  tt0000002            5.8       265
2  tt0000005            6.2      2622
3  tt0000006            5.1       182
4  tt0000007            5.4       820

### 'title_genres' SQL table

In [48]:
# Display the names, non-null values, and datatypes for the columns
title_genres_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 153361 entries, 0 to 81842
Data columns (total 2 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   tconst        153361 non-null  object
 1   genres_split  153361 non-null  object
dtypes: object(2)
memory usage: 3.5+ MB

In [49]:
## Calculate max string lengths for object columns
key_len = title_genres_df['tconst'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
title_genres_df_schema = {
    "tconst": String(key_len+1),
    'genre_id':Integer()}

In [50]:
# Save the dataframe to an sql table
# with appropriate datatypes and set index=False
title_genres_df.to_sql('title_genres',
              engine, 
              dtype=df_schema,
              if_exists='replace',
              index=False)

153361

In [51]:
# Display the first 5 rows of the table using a SQL query
q = """
SELECT * 
FROM title_genres LIMIT 5
;"""
pd.read_sql(q, engine)

      tconst genres_split
0  tt0035423       Comedy
1  tt0035423      Fantasy
2  tt0035423      Romance
3  tt0043139        Drama
4  tt0043139      History

### genres SQL Table

In [55]:
genres_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25 entries, 0 to 24
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   genre_name  25 non-null     object
 1   genre_id    25 non-null     int64
dtypes: int64(1), object(1)
memory usage: 528.0+ bytes

In [65]:
genres_df = genres_df[['genre_id', 'genre_name']]
genres_df.head(1)

   genre_id genre_name
0         0     Action

In [66]:
## Calculate max string lengths for object columns
text_len = genres_df['genre_name'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
genres_df_schema = {
    'Genre_ID':Integer(),
    "Genre_Name": Text(key_len+1)
    }

In [67]:
# Save to sql with dtype and index=False
genres_df.to_sql('genres',
                 engine,
                 dtype=genres_df_schema,
                 if_exists='replace', index=False)

25

In [68]:
# Use the sqlalchemy engine to update the table and set genre_id as the primary key
engine.execute('ALTER TABLE genres ADD PRIMARY KEY (`genre_id`);')

In [69]:
# Display the first 5 rows of the table using an SQL query
q = """
SELECT * 
FROM genres LIMIT 5
;"""
pd.read_sql(q, engine)

   genre_id genre_name
0         0     Action
1         1      Adult
2         2  Adventure
3         3  Animation
4         4  Biography

### tmdb_data SQL Table

In [71]:
# Display the names, non-null values, and datatypes for the columns
df_tmdb.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 638 entries, 1 to 638
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   imdb_id        638 non-null    object
 1   budget         638 non-null    float64
 2   revenue        638 non-null    float64
 3   certification  430 non-null    object
dtypes: float64(2), object(2)
memory usage: 20.1+ KB

In [72]:
## Calculate max string lengths for object columns
key_len = df_tmdb['imdb_id'].fillna('').map(len).max()
title_len = df_tmdb['certification'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_tmdb_schema = {
    "imdb_id": String(key_len+1), 
    "certification": Text(title_len+1),
    'budget':Float(),
    'revenue':Float()}

In [73]:
# Save to sql with dtype and index=False
df_tmdb.to_sql('tmdb_data',
                 engine,
                 dtype=df_tmdb_schema,
                 if_exists='replace', index=False)

638

In [74]:
# Use the sqlalchemy engine to update the table and set imdb_id as the primary key
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')

In [75]:
# Display the first 5 rows of the table using an SQL query
q = """
SELECT * 
FROM tmdb_data LIMIT 5
;"""
pd.read_sql(q, engine)

     imdb_id      budget     revenue certification
0  tt0035423  48000000.0  76019000.0         PG-13
1  tt0118589  22000000.0   5271670.0         PG-13
2  tt0118652   1000000.0         0.0             R
3  tt0118694    150000.0  14204600.0            PG
4  tt0119004         0.0      6297.0          None

### Show all SQL Tables

In [76]:
# Display the SQL table names using an SQL query
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data